# Описание алгоритма решения задачи

Задача. Написать программу, которая из имеющегося массива строк формирует новый массив из строк, длина которых меньше, либо равна 3 символам. Первоначальный массив можно вввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.

## Выбор языка программирования

Знакомство с языками программирования в основном блоке обучения основывалось на изучении основ C#. Нельзя сказать, что полученный материал охватил большую часть основ языка, тем не менее, полученных знаний достаточно для написания программы.

В ходе буткемпа, кроме того, мы получили некоторые знания по  языку программирования Python. Курс буткемпа не охватывал основы языка. Он был больше направлен на специализацию, без пояснения каких либо основ языка.

**Соответсвенно, без вариантов, выбор языка программирования очевиден - С#.**

## Алгоритм задачи

По условию задачи, имеется возможнось задать первоначальный массив следующими способами:
* ввести с клавиатуры
* задать на старте программы

При написании программы, воспользуемся вторым вариантом. В дальнейшем, с целью проверки правильности работы алгоритма, добавим возможность задать первоначальный массив с клавиатуры.

На старте программы, проверим содержимое массива строк на наличие в нем строк, длина которых меньше, либо равна 3 символам. Для этого, воспользуемся целочисленной переменной *count* (для хранения количесива найденных строк длинной <= 3) и оператором итерации *foreach()*
```sh
foreach (string str in myArray) {
    if (str.Length <= 3) count++;
}
```
Получив количество строк, длина которых меньше, либо равна 3 символам, создадим новый массив строк для хранения результатов.
```sh
string[] endArray = new string[count];
```
Теперь, в завершении программы, воспользуемся еще одной итерацией *foreach()*, а в целочисленной переменной *count* будем хранить индекс элемента нового пока еще незаполненного массива строк.
```sh
foreach (string str in myArray) {
    if (str.Length <= 3){
        endArray[count] = str;
        count++;
    }
```
Выведем содержимое нового массива на консоль
```sh
Console.WriteLine($"Окончательный массив: [{string.Join(" , ", endArray)}]");
```
Как и планировалось ранее, усовершенствуем программу, добавив возможность задать массив строк через консоль (ввести с клавиатуры). Для этого предложим пользователю заполнить массив строками, вводя строки в консоль через пробел. Полученную строку *myStringData* преобразуем в массив строк методом *String.Split()*
```sh
Console.Write("Заполните массив строками через пробел: ");
string myStringData = Console.ReadLine();
string[] myArray = myStringData.Split(" ");
```


### Примечание
При использовании коллекций, решение данной задачи было бы возможно за счет всего лишь одной итерации.

